# Exercícios

In [1]:
import pandas as pd
dados = pd.DataFrame({'Profissão': [1, 2, 3, 1, 2, 2, 2, 3, 3, 2, 1, 3]})

In [2]:
dados

    Profissão
0           1
1           2
2           3
3           1
4           2
5           2
6           2
7           3
8           3
9           2
10          1
11          3

In [3]:
frequencia = dados['Profissão'].value_counts()
porcentagem = dados['Profissão'].value_counts(normalize=True)*100

In [4]:
frequencia

2    5
3    4
1    3
Name: Profissão, dtype: int64

In [5]:
porcentagem

2    41.666667
3    33.333333
1    25.000000
Name: Profissão, dtype: float64

In [6]:
dados_completos = pd.DataFrame({'Frequencia': frequencia, 'Porcentagem (%)': porcentagem}).round(2)

In [7]:
dados_completos

   Frequencia  Porcentagem (%)
2           5            41.67
3           4            33.33
1           3            25.00

In [8]:
dados_completos.rename(index = {1: 'Estatístico', 2: 'Cientista de Dados', 3: 'Programador Python'}, inplace=True)

In [9]:
dados_completos.rename_axis('Profissão', axis='columns', inplace=True)

In [10]:
dados_completos

Profissão           Frequencia  Porcentagem (%)
Cientista de Dados           5            41.67
Programador Python           4            33.33
Estatístico                  3            25.00

In [11]:
dados = pd.read_csv('dados.csv')

In [12]:
classes = [dados.Altura.min(), 1.65, 1.75, dados.Altura.max()]
labels = ['1 - Baixa', '2 - Média', '3 - Alta']

frequencia = pd.value_counts(
    pd.cut(
        x = dados.Altura,
        bins = classes,
        labels = labels,
        include_lowest = True
    )
)

percentual = pd.value_counts(
    pd.cut(
        x = dados.Altura,
        bins = classes,
        labels = labels,
        include_lowest = True
    ), normalize = True
) * 100

dist_freq_altura = pd.DataFrame(
    {'Frequência': frequencia, 'Porcentagem (%)': percentual}
)

dist_freq_altura.rename_axis('Estaturas', axis= 'columns', inplace = True)

dist_freq_altura.sort_index(ascending = True, inplace = True)

dist_freq_altura

Estaturas  Frequência  Porcentagem (%)
1 - Baixa       20529        26.716554
2 - Média       36162        47.061426
3 - Alta        20149        26.222020

In [13]:
dataset = pd.DataFrame({
    'Sexo': ['H', 'M', 'M', 'M', 'M', 'H', 'H', 'H', 'M', 'M'],
    'Idade': [53, 72, 54, 27, 30, 40, 58, 32, 44, 51]
})
dataset

  Sexo  Idade
0    H     53
1    M     72
2    M     54
3    M     27
4    M     30
5    H     40
6    H     58
7    H     32
8    M     44
9    M     51

In [14]:
dataset['Idade'].mean()

46.1

In [15]:
dataset.groupby(['Sexo'])['Idade'].mean()

Sexo
H    45.750000
M    46.333333
Name: Idade, dtype: float64

In [16]:
dataset.groupby('Sexo').mean().loc['H']

Idade    45.75
Name: H, dtype: float64

In [17]:
df = pd.DataFrame(data = {'Fulano': [8, 10, 4, 8, 6, 10, 8],
                          'Sicrano': [7.5, 8, 7, 8, 8, 8.5, 7]}, 
                  index = ['Matemática', 
                           'Português', 
                           'Inglês', 
                           'Geografia', 
                           'História', 
                           'Física', 
                           'Química'])
df.rename_axis('Matérias', axis = 'columns', inplace = True)
df

Matérias    Fulano  Sicrano
Matemática       8      7.5
Português       10      8.0
Inglês           4      7.0
Geografia        8      8.0
História         6      8.0
Física          10      8.5
Química          8      7.0

In [18]:
df['Fulano'].mad()

1.5510204081632648

In [19]:
df['Sicrano'].mad()

0.4693877551020408

In [20]:
dataset = pd.DataFrame({
    'Sexo': ['H', 'M', 'M', 'M', 'M', 'H', 'H', 'H', 'M', 'M'],
    'Idade': [53, 72, 54, 27, 30, 40, 58, 32, 44, 51]
})

In [21]:
dataset['Idade'].std()

14.184890239656813

In [22]:
dataset.std()

C:\Users\COMISS~1\AppData\Local\Temp/ipykernel_14720/178401259.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dataset.std()

Idade    14.18489
dtype: float64

In [23]:
dataset = pd.DataFrame({
    'Sexo': ['H', 'M', 'M', 'M', 'M', 'H', 'H', 'H', 'M', 'M'],
    'Idade': [53, 72, 54, 27, 30, 40, 58, 32, 44, 51]
})

In [25]:
dataset.query('Sexo=="M"')['Idade'].std()

16.64531966249572

In [26]:
dataset.groupby(['Sexo']).std().loc['M']

Idade    16.64532
Name: M, dtype: float64